src/Documents/Разборка/Разборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Разборка</name>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияВ</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/МестаХранения/МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МестаХранения</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыМПЗ/ВидыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМПЗ</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Разборка/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаОтПокупателя") Тогда	
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение,Дата));
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
МестаХранения = РегистрыНакопления.МестаХранения;
// регистр МестаХранения Расход
Движения.МестаХранения.Записывать = Истина;
КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(МестоХранения,Изделие,Дата);		
	Если КолОстаток >= Количество Тогда
	Движение = Движения.МестаХранения.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.МестоХранения = МестоХранения;
		Если ТипЗнч(Изделие) = Тип("СправочникСсылка.Номенклатура") Тогда
		Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
		Иначе	
		Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;		
		КонецЕсли;
	Движение.МПЗ = Изделие;
	Движение.Количество = Количество;
	Иначе
	Отказ = Истина;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Текст = "МПЗ: "+СокрЛП(Изделие.Наименование)+" требуется: "+Количество+" недостаёт на складе: "+Строка(Количество-КолОстаток);
	Сообщение.Сообщить();
	КонецЕсли;

МестаХранения = РегистрыНакопления.МестаХранения;
// регистр МестаХранения Расход
Движения.МестаХранения.Записывать = Истина;
ВиртуальнаяТабличнаяЧасть = ТабличнаяЧасть.Выгрузить();
ВиртуальнаяТабличнаяЧасть.Свернуть("ВидМПЗ,МПЗ,ЕдиницаИзмерения","Количество");
	Для Каждого ТЧ Из ВиртуальнаяТабличнаяЧасть Цикл
	Движение = Движения.МестаХранения.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.МестоХранения = МестоХраненияВ;
	Движение.ВидМПЗ = ТЧ.ВидМПЗ; 
	Движение.МПЗ = ТЧ.МПЗ;
	Движение.Количество = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
	КонецЦикла;
КонецПроцедуры
